import random

val = 5
size = 11
c = [val] * size
c.append(random.randrange(1, 11, 3))
c1 = list()
c2 = list()
c3 = list()
for _ in range(4):
    c1.append(c.pop((random.randrange(0, len(c)))))
    c2.append(c.pop((random.randrange(0, len(c)))))
    c3.append(c.pop((random.randrange(0, len(c)))))
# 1 способ
if c1 == c2:
    print("Кучи 1 и 2 содержат только настоящие монеты, фальшивая монета в куче 3")
    if c3[0] + c3[1] + c3[2] == c1[0] + c1[1] + c1[2]:
        if c1[0] > c3[3]:
            print("12 монета фальшивая и легче")
        elif c1[0] < c3[3]:
            print("12 монета фальшивая и тяжелее")
    elif c3[0] + c3[1] + c3[2] > c1[0] + c1[1] + c1[2]:
        if c3[0] == c3[1]:
            print("11 монета фальшивая и она тяжелее")
        elif c3[0] > c3[1]:
            print("9 монета фальшивая и она тяжелее")
        elif c3[0] < c3[1]:
            print("10 монета фальшивая и она тяжелее")
    elif c1[0] + c1[1] + c1[2] > c3[0] + c3[1] + c3[2]:
        if c3[0] == c3[1]:
            print("11 монета фальшивая и она легче")
        elif c3[0] > c3[1]:
            print("10 монета фальшивая и она легче")

# 2 способ

elif sum(c1) > sum(c2):
    if c1[0] + c1[1] + c2[0] == c1[2] + c1[3] + c3[2]:

        if c2[1] == c2[2]:
            print("8 - фальшивая и она легче")

    elif c1[0] + c1[1] + c2[0] > c1[2] + c1[3] + c3[2]:

        if c1[0] > c1[1]:
            print("Фальшивая монета 1 и она тяжелее")
        elif c1[0] < c1[1]:
            print("Фальшивая монета 2 и она тяжелее")

    elif c1[0] + c1[1] + c2[0] < c1[2] + c1[3] + c3[2]:

        if c1[2] > c1[3]:
            print("3 монета фальшивая и она тяжелее")

# 1 способ

if sum(c1) == sum(c3):
    print("Кучи 1 и 3 содержат только настоящие монеты, фальшивая монета в куче 2")
    if c1[0] + c1[1] + c1[2] == c2[0] + c2[1] + c2[2]:
        if c1[0] > c2[3]:
            print("8 монета фальшивая и легче")
        elif c1[0] < c2[3]:
            print("8 монета фальшивая и тяжелее")
    elif c1[0] + c1[1] + c1[2] > c2[0] + c2[1] + c2[2]:
        if c2[0] == c2[1]:
            print("7 монета фальшивая и она легче")
        elif c2[0] > c2[1]:
            print("6 монета фальшивая и она легче")
        elif c2[0] < c2[1]:
            print("5 монета фальшивая и она легче")
    elif c1[0] + c1[1] + c1[2] < c2[0] + c2[1] + c2[2]:
        if c2[0] == c2[1]:
            print("7 монета фальшивая и она тяжелее")
        elif c2[0] < c2[1]:
            print("6 монета фальшивая и она тяжелее")
        elif c2[0] > c2[1]:
            print("5 монета фальшивая и она тяжелее")

# 2 способ

elif sum(c1) > sum(c3):

    if c1[0] + c1[1] + c3[0] < c1[2] + c1[3] + c2[2]:

        if c1[2] == c1[3]:
            print("9 монета фальшивая и она легче")

if sum(c2) == sum(c3):
    print("Кучи 2 и 3 содержат только настоящие монеты, фальшивая монета в куче 1")
    if c1[0] + c1[1] + c1[2] == c2[0] + c2[1] + c2[2]:
        if c1[3] > c2[0]:
            print("фальшивая монета 4 и тяжелее")
        elif c1[3] < c2[0]:
            print("фальшивая монета 4 и легче")
    elif c1[0] + c1[1] + c1[2] < c2[0] + c2[1] + c2[2]:
        if c1[1] == c1[2]:
            print("фальшивая монета 1 и легче")
        elif c1[1] > c1[2]:
            print("фальшивая монета 3 и легче")
        elif c1[1] < c1[2]:
            print("фальшивая монета 2 и легче")

print(c1, c2, c3)


